Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetTransparency(System.Double)
Sets the transparency parameter of the effect instance.
transparency:
The transparency value.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetGlossiness(System.Double)
Sets the glossiness parameter of the effect instance.
glossiness:
The glossiness value.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetSpecularColor(Autodesk.Revit.DB.Color)
Sets the specular color parameter of the effect instance.
color:
The specular color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetEmissiveColor(Autodesk.Revit.DB.Color)
Sets the emissive color parameter of the effect instance.
color:
The emissive color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetDiffuseColor(Autodesk.Revit.DB.Color)
Sets the diffuse color parameter of the effect instance.
color:
The diffuse color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetAmbientColor(Autodesk.Revit.DB.Color)
Sets the ambient color parameter of the effect instance.
color:
The ambient color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetColor(Autodesk.Revit.DB.Color)
Sets the color parameter of the effect instance.
color:
The color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.MatchesFormat(Autodesk.Revit.DB.DirectContext3D.VertexFormat)
Tests whether the effect instance is appropriate for the given vertex format.
Remarks:
The vertex format may define vertex data that are not used by the effect instance. However, the effect
instance can not reference vertex data that do not exist in the vertex format.
vertexFormat:
A vertex format.
Returns:
True if the effect instance is valid for use with the specified vertex format.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.IsValid
Tests whether the effect instance is valid for rendering.
Remarks:
The effect instances are internally associated with low-level graphics state and may become invalidated when
the state changes. Therefore, an application should test each effect instance for validity before using it when
submitting geometry. If the effect instance becomes invalid, the application should re-create it.
Returns:
True if the effect instance is valid for rendering, false otherwise.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.EffectInstance.#ctor(Autodesk.Revit.DB.DirectContext3D.VertexFormatBits)
Constructs the effect instance for geometry having the specified vertex format.
vertexFormatBits:
The vertex format of the geometry to be used with this effect instance.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This EffectInstance is not available because Revit is not currently rendering. In general, this EffectInstance must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance
An effect instance that controls the appearance of geometry.
Remarks:
Each effect instance should be used with geometry of a matching vertex format. Only a subset of effect instance
parameters is relevant to geometry of a particular vertex format.
If the vertex format does not specify vertex color
(Autodesk.Revit.DB.DirectContext3D.VertexPosition or Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal)
the following parameters should be set:
ColorTransparency
If the vertex format specifies vertex normals
(Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal or Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored)
the following parameters should be set:
Ambient ColorDiffuse ColorSpecular ColorGlossiness (specular exponent)EmissiveColorTransparency
If the vertex format specifies a color, then the geometry will be colored according to the color of each
vertex. Otherwise, the geometry's color will come from the effect instance parameters. Similarly, the transparency parameter
affects all of the geometry associated with the effect, while the transparency of the individual vertices can also
be controlled via the transparency component of their colors.
Since:
2017